In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import sklearn
from sklearn.model_selection import train_test_split
import tensorflow as tf
from tensorflow import keras

In [3]:
# Import training and validation sets 
df = pd.read_csv("data/sales_train.csv", low_memory=False)

In [4]:
df.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [5]:
df = df.drop('date', axis=1)

In [6]:
df

         date_block_num  shop_id  item_id  item_price  item_cnt_day
0                     0       59    22154      999.00           1.0
1                     0       25     2552      899.00           1.0
2                     0       25     2552      899.00          -1.0
3                     0       25     2554     1709.05           1.0
4                     0       25     2555     1099.00           1.0
...                 ...      ...      ...         ...           ...
2935844              33       25     7409      299.00           1.0
2935845              33       25     7460      299.00           1.0
2935846              33       25     7459      349.00           1.0
2935847              33       25     7440      299.00           1.0
2935848              33       25     7460      299.00           1.0

[2935849 rows x 5 columns]

In [7]:
from keras.models import Sequential
from keras.layers import Dense
model = Sequential()
model.add(Dense(128, activation='relu', input_dim=4))
model.add(Dense(128, activation='relu'))
model.add(Dense(1))
model.compile(optimizer='adam', loss='mae', metrics=['mae'])
model.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense (Dense)               (None, 128)               640

 dense_1 (Dense)             (None, 128)               16512

 dense_2 (Dense)             (None, 1)                 129

=================================================================
Total params: 17,281
Trainable params: 17,281
Non-trainable params: 0
_________________________________________________________________

In [8]:
x = df.drop('item_price', axis=1)
y = df['item_price']
hist = model.fit(x, y, validation_split=0.2, epochs=1)

73397/73397 [==============================] - 285s 4ms/step - loss: 591.7057 - mae: 591.7057 - val_loss: 741.0128 - val_mae: 741.0128